app/controllers/opus_controller.rb

  def index
    @opus = Opu.all
---
SELECT `opus`.* FROM `opus`