app/controllers/payments_controller.rb

  def index
    if params['viewFrom']
      @from_date = Time.new(params['viewFrom']['from(1i)'], params['viewFrom']['from(2i)'], params['viewFrom']['from(3i)'])
    else
      @from_date = Time.now - 1.days
    end
    if params['viewTo']
      @to_date = Time.new(params['viewTo']['to(1i)'], params['viewTo']['to(2i)'], params['viewTo']['to(3i)'])
    else
      @to_date = Time.now
    end
    @from_date = @from_date.strftime("%Y-%m-%d") + ' 00:00:00'
    @to_date = @to_date.strftime("%Y-%m-%d") + ' 23:59:59'
    if params['viewFrom'] and params['viewTo']
      puts "DATEEEEE"
      puts @from_date.to_datetime
      puts @to_date.to_datetime
      #@payments = ActiveRecord::Base.connection.execute("SELECT * FROM payments WHERE date between '#{@from_date}' and  '#{@to_date}'")
      @payments = Payment.where(date: (@from_date.to_datetime..@to_date.to_datetime))
    else
      @payments = Payment.order(sort_column + ' ' + sort_direction)
---
SELECT `payments`.* FROM `payments` ORDER BY date asc